gicking/STM8_headers/SVD/STM8TL53F4.svd
      </registers>
      <interrupt>
        <name>Interrupt_IRQ29</name>
        <description>Interrupt_IRQ29 interrupt</description>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ITC_EXTI</name>
      <baseAddress>0x50A0</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>6</size>
        <usage>registers</usage>
      </addressBlock>
      <description>ITC_EXTI</description>
      <groupName>ITC_EXTI</groupName>
      <registers>
        <register>
          <name>CR1</name>
          <description>External interrupt control register 1</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>P0IS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P1IS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P2IS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P3IS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>External interrupt control register 2</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>P4IS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P5IS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P6IS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P7IS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>External interrupt control register 3</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PDIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PBIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>External interrupt status register 1</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>P0F</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1F</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2F</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3F</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4F</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5F</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6F</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7F</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>External interrupt status register 2</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PBF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>External interrupt port select register</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PBLIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBHIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDLIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDHIS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ITC_SPR</name>
      <baseAddress>0x7F70</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>8</size>
        <usage>registers</usage>
      </addressBlock>
      <description>ITC_SPR</description>
      <groupName>ITC_SPR</groupName>
      <registers>
        <register>
          <name>SPR1</name>
          <description>Interrupt Software priority register 1</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT1SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR2</name>
          <description>Interrupt Software priority register 2</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT4SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT6SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT7SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR3</name>
          <description>Interrupt Software priority register 3</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT8SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT9SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT10SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT11SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR4</name>
          <description>Interrupt Software priority register 4</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT12SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT13SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT14SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT15SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR5</name>
          <description>Interrupt Software priority register 5</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT18SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT19SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR6</name>
          <description>Interrupt Software priority register 6</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT20SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT21SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT22SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR7</name>
          <description>Interrupt Software priority register 7</description>
          <size>8</size>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT25SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT26SPR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT27SPR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPR8</name>
          <description>Interrupt Software priority register 8</description>
          <size>8</size>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>VECT28SPR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VECT29SPR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
