gicking/STM8_headers/SVD/STM8TL53F4.svd
        <register>
          <name>RXSRL</name>
          <description>ProxSense receiver status register low</description>
          <size>8</size>
          <addressOffset>0x001F</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>VALID0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALID7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX0CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x0020</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX0CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX0CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x0021</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX0CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX1CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x0022</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX1CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX1CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x0023</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX1CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX2CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x0024</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX2CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX2CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x0025</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX2CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX3CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x0026</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX3CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX3CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x0027</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX3CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX4CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x0028</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX4CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX4CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x0029</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX4CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX5CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x002A</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX5CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX5CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x002B</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX5CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX6CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x002C</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX6CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX6CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x002D</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX6CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX7CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x002E</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX7CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX7CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x002F</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX7CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX8CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x0030</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX8CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX8CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x0031</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX8CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX9CNTRH</name>
          <description>ProxSense counter register receiver channel high</description>
          <size>8</size>
          <addressOffset>0x0032</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX9CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX9CNTRL</name>
          <description>ProxSense counter register receiver channel low</description>
          <size>8</size>
          <addressOffset>0x0033</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX9CNT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX0CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0040</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX0CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX1CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0041</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX1CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX2CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0042</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX2CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX3CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0043</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX3CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX4CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0044</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX4CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX5CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0045</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX5CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX6CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0046</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX6CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX7CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0047</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX7CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX8CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0048</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX8CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX9CSSELR</name>
          <description>ProxSense receiver sampling capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0049</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX9CSSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX0EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0050</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX0EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX1EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0051</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX1EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX2EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0052</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX2EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX3EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0053</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX3EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX4EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0054</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX4EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX5EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0055</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX5EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX6EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0056</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX6EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX7EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0057</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX7EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX8EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0058</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX8EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX9EPCCSELR</name>
          <description>ProxSense receiver electrode parasitic compensation capacitor selection register</description>
          <size>8</size>
          <addressOffset>0x0059</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RX9EPCC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
